{
    "augmented_dialogues": [
        {
            "id": "Negotiating enterprise contracts._1_0_0",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hi there! I'm glad we can chat about the enterprise contract today. How would you like to kick things off?"
                },
                {
                    "participant": "user",
                    "text": "Hi, I'm all set to talk about the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Awesome, let’s go over the scope of the contract. Can you share your primary requirements?"
                },
                {
                    "participant": "user",
                    "text": "Here’s what we need from the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Got it. Now, let’s move on to pricing. What budget do you have in mind for this project?"
                },
                {
                    "participant": "user",
                    "text": "Actually, is it possible to revise the budget?"
                },
                {
                    "participant": "assistant",
                    "text": "Are you looking to change the pricing terms?"
                },
                {
                    "participant": "user",
                    "text": "We can raise the budget to $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Got it. Now, let’s move on to pricing. What budget do you have in mind for this project?"
                },
                {
                    "participant": "user",
                    "text": "Our budget stands at $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "Thank you for that. Next, let's talk about the timeline. When do you need the project completed?"
                },
                {
                    "participant": "user",
                    "text": "We need the project completed by December."
                },
                {
                    "participant": "assistant",
                    "text": "Based on our conversation, I think we have a solid agreement. Should we move forward to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "Yes, let's go ahead and finalize the contract."
                },
                {
                    "participant": "assistant",
                    "text": "I understand. If you need any more assistance, don't hesitate to reach out. Have a wonderful day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_0_1",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hello! I'm pleased we can go over the enterprise contract. What would you like to start with?"
                },
                {
                    "participant": "user",
                    "text": "Hello, I'm prepared to go over the contract details."
                },
                {
                    "participant": "assistant",
                    "text": "Great! Let's discuss the contract's scope. What are your main needs?"
                },
                {
                    "participant": "user",
                    "text": "These are our primary requirements."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Next, let’s discuss the pricing. What budget are you considering for this project?"
                },
                {
                    "participant": "user",
                    "text": "Can I modify the budget, please?"
                },
                {
                    "participant": "assistant",
                    "text": "Would you like to modify the pricing details?"
                },
                {
                    "participant": "user",
                    "text": "We're willing to increase the budget to $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Let’s discuss the pricing now. What budget have you allocated for this project?"
                },
                {
                    "participant": "user",
                    "text": "We have a budget of $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "I appreciate that. Let’s discuss the timeline. When should we aim to finish the project?"
                },
                {
                    "participant": "user",
                    "text": "The deadline for the project is December."
                },
                {
                    "participant": "assistant",
                    "text": "It seems we have a good agreement based on our discussions. Shall we proceed with finalizing the contract?"
                },
                {
                    "participant": "user",
                    "text": "Absolutely, let's wrap up and finalize the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Got it. If you require further help, feel free to contact me. Have a great day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_0_2",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hi! I'm happy to discuss the enterprise contract today. Where would you like to begin?"
                },
                {
                    "participant": "user",
                    "text": "Hi there, I'm ready to dive into the contract discussion."
                },
                {
                    "participant": "assistant",
                    "text": "Perfect, let's talk about the scope. Could you outline your key requirements?"
                },
                {
                    "participant": "user",
                    "text": "Let me outline our main needs."
                },
                {
                    "participant": "assistant",
                    "text": "Okay, let’s talk about costs. What budget have you set aside for this project?"
                },
                {
                    "participant": "user",
                    "text": "I’d like to make a change to the budget, if that's okay."
                },
                {
                    "participant": "assistant",
                    "text": "Do you want to adjust the terms regarding pricing?"
                },
                {
                    "participant": "user",
                    "text": "Let’s adjust the budget to $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Okay, let’s address the pricing. What budget are we looking at for this project?"
                },
                {
                    "participant": "user",
                    "text": "The budget we have is $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "Thanks for sharing that. Now, let’s move on to the timeline. When do you expect the project to be done?"
                },
                {
                    "participant": "user",
                    "text": "We require the project to be finished by December."
                },
                {
                    "participant": "assistant",
                    "text": "From what we've discussed, I believe we have a strong agreement. Are you ready to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "Yes, I'm ready to finalize the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. If you need anything else, don't hesitate to ask. Wishing you a great day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_1_0",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hi there! I'm pleased we can go over the enterprise contract today. How would you like to start?"
                },
                {
                    "participant": "user",
                    "text": "Hi, I'm prepared to go over the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Awesome, let's go over the scope of the contract. Can you share your key requirements?"
                },
                {
                    "participant": "user",
                    "text": "Here are the key requirements we have."
                },
                {
                    "participant": "assistant",
                    "text": "Got it. Now, let's address pricing. What budget do you have set aside for this project?"
                },
                {
                    "participant": "user",
                    "text": "Actually, is it possible to modify the budget?"
                },
                {
                    "participant": "assistant",
                    "text": "Are you looking to revise the pricing terms?"
                },
                {
                    "participant": "user",
                    "text": "We can raise the budget to $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Got it. Now, let’s revisit the pricing. What budget have you set for this project?"
                },
                {
                    "participant": "user",
                    "text": "Our budget stands at $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "Thanks for sharing. Next, let’s discuss the timeline. When do you need the project completed?"
                },
                {
                    "participant": "user",
                    "text": "We require the project to be completed by December."
                },
                {
                    "participant": "assistant",
                    "text": "Based on our conversation, I think we have a solid agreement. Shall we move forward with finalizing the contract?"
                },
                {
                    "participant": "user",
                    "text": "I need to step out of this negotiation now."
                },
                {
                    "participant": "assistant",
                    "text": "I understand. If you require any further assistance, don’t hesitate to reach out. Have a wonderful day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_1_1",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hello! I'm happy to have this conversation about the enterprise contract. Where would you like to kick things off?"
                },
                {
                    "participant": "user",
                    "text": "Hello, I'm set to discuss the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Great! Let's take a look at the contract's scope. Could you detail your primary needs?"
                },
                {
                    "participant": "user",
                    "text": "I’d like to present our main requirements now."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Let's move on to the pricing aspect. What budget have you planned for this project?"
                },
                {
                    "participant": "user",
                    "text": "Can I adjust the budget amount?"
                },
                {
                    "participant": "assistant",
                    "text": "Do you want to change the pricing conditions?"
                },
                {
                    "participant": "user",
                    "text": "We're able to increase the budget to $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Let’s return to the pricing discussion. How much have you budgeted for this project?"
                },
                {
                    "participant": "user",
                    "text": "We have allocated $100,000 for the budget."
                },
                {
                    "participant": "assistant",
                    "text": "I appreciate that. Now, let’s talk about the timeline. By what date do you need this project finished?"
                },
                {
                    "participant": "user",
                    "text": "The project needs to be finalized by December."
                },
                {
                    "participant": "assistant",
                    "text": "From what we've discussed, it seems we have a good agreement. Are you ready to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "I have to leave this negotiation at this point."
                },
                {
                    "participant": "assistant",
                    "text": "I get it. Should you need any more help, feel free to contact me. Have a great day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_1_2",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Greetings! I'm excited to discuss the enterprise contract with you today. What would you like to begin with?"
                },
                {
                    "participant": "user",
                    "text": "Hi there, I'm ready to dive into the contract discussion."
                },
                {
                    "participant": "assistant",
                    "text": "Perfect, let's discuss the details of the contract. What are your main requirements?"
                },
                {
                    "participant": "user",
                    "text": "These are the primary requirements from our side."
                },
                {
                    "participant": "assistant",
                    "text": "Okay, let's talk about the pricing. How much budget do you have allocated for this project?"
                },
                {
                    "participant": "user",
                    "text": "Would it be alright if I changed the budget?"
                },
                {
                    "participant": "assistant",
                    "text": "Would you like to modify the pricing agreement?"
                },
                {
                    "participant": "user",
                    "text": "The new budget can be set at $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Alright, let's go back to pricing. What budget do you have in mind for this project?"
                },
                {
                    "participant": "user",
                    "text": "The budget we have is $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "Thank you for that information. Let’s move on to the timeline. When should the project be wrapped up?"
                },
                {
                    "participant": "user",
                    "text": "We aim to have the project done by December."
                },
                {
                    "participant": "assistant",
                    "text": "It looks like we have a strong agreement based on our talks. Should we proceed to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "I must exit this negotiation for now."
                },
                {
                    "participant": "assistant",
                    "text": "No problem at all. If you need any additional support, just let me know. Wishing you a great day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_2_0",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hi there! I'm pleased we can go over the enterprise contract today. Where would you like to start?"
                },
                {
                    "participant": "user",
                    "text": "Hi, I'm prepared to go over the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Awesome, let’s dive into the details of the contract. Can you share your key requirements?"
                },
                {
                    "participant": "user",
                    "text": "Here are the key requirements we have."
                },
                {
                    "participant": "assistant",
                    "text": "Got it. Now, let's discuss the pricing. How much have you budgeted for this project?"
                },
                {
                    "participant": "user",
                    "text": "Can I revise the budget, actually?"
                },
                {
                    "participant": "assistant",
                    "text": "Are you looking to modify the pricing details?"
                },
                {
                    "participant": "user",
                    "text": "We can raise the budget to $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Got it. Now, let’s discuss the pricing again. What budget have you set for this project?"
                },
                {
                    "participant": "user",
                    "text": "Our budget stands at $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "Thank you for that. Now, let’s establish a timeline. When do you plan for the project to be completed?"
                },
                {
                    "participant": "user",
                    "text": "We need to have the project completed by December."
                },
                {
                    "participant": "assistant",
                    "text": "Based on what we've discussed, I think we have a solid agreement. Should we move forward with finalizing the contract?"
                },
                {
                    "participant": "user",
                    "text": "Yes, let's go ahead and finalize the contract."
                },
                {
                    "participant": "assistant",
                    "text": "I understand. If you have any more questions or need assistance, don't hesitate to reach out. Have a fantastic day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_2_1",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hello! I’m happy to be discussing the enterprise contract with you. How do you want to kick things off?"
                },
                {
                    "participant": "user",
                    "text": "Hello, I'm set to discuss the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Fantastic, let’s get into the scope of the contract. What are your primary needs?"
                },
                {
                    "participant": "user",
                    "text": "These are our primary requirements."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Next, let’s talk about the budget. What financial range are you considering for this project?"
                },
                {
                    "participant": "user",
                    "text": "Is it possible to modify the budget?"
                },
                {
                    "participant": "assistant",
                    "text": "Do you want to change the pricing structure?"
                },
                {
                    "participant": "user",
                    "text": "I can increase the budget to $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Let's revisit the pricing. How much have you allocated for this project?"
                },
                {
                    "participant": "user",
                    "text": "We have allocated $100,000 for the budget."
                },
                {
                    "participant": "assistant",
                    "text": "Thanks for sharing. Now, let’s discuss the timeline. When do you expect the project to wrap up?"
                },
                {
                    "participant": "user",
                    "text": "The project needs to be done by December."
                },
                {
                    "participant": "assistant",
                    "text": "From our conversation, it seems we have a good agreement in place. Shall we proceed to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "Absolutely, I'm ready to finalize the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Got it. If you need any additional help, feel free to contact me. Enjoy your day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_2_2",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Greetings! I’m excited to talk about the enterprise contract today. What would you like to begin with?"
                },
                {
                    "participant": "user",
                    "text": "Hi there, I'm ready to talk about the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Great, let’s talk about what the contract will cover. Could you detail your main requirements?"
                },
                {
                    "participant": "user",
                    "text": "Let me outline our main requirements for you."
                },
                {
                    "participant": "assistant",
                    "text": "Okay, let’s move on to pricing. What budget do you have in mind for this project?"
                },
                {
                    "participant": "user",
                    "text": "Would it be alright if I adjusted the budget?"
                },
                {
                    "participant": "assistant",
                    "text": "Would you like to revisit the pricing terms?"
                },
                {
                    "participant": "user",
                    "text": "We're able to boost the budget to $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Okay, let’s talk about the budget once more. What is the financial range you’re working with?"
                },
                {
                    "participant": "user",
                    "text": "The budget we’re working with is $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "I appreciate that. Now, let’s talk about the timeline. By when do you want the project finished?"
                },
                {
                    "participant": "user",
                    "text": "We're aiming to finalize the project by December."
                },
                {
                    "participant": "assistant",
                    "text": "Given our discussion, I believe we have a strong agreement. Are we ready to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "Sure, let’s complete the contract finalization."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. If there's anything else you need, please let me know. Have a wonderful day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_3_0",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hi there! I'm pleased we can go over the enterprise contract today. How would you like to start?"
                },
                {
                    "participant": "user",
                    "text": "Hi, I’m prepared to go through the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Awesome, let’s dive into the contract's scope. Can you share your primary requirements?"
                },
                {
                    "participant": "user",
                    "text": "Here are the key requirements we have."
                },
                {
                    "participant": "assistant",
                    "text": "Got it. Now, let’s talk about pricing. What budget do you have in mind for this project?"
                },
                {
                    "participant": "user",
                    "text": "Actually, is it possible to adjust the budget?"
                },
                {
                    "participant": "assistant",
                    "text": "Would you prefer to revise the pricing terms?"
                },
                {
                    "participant": "user",
                    "text": "Upon reflection, we’d like to set the budget to $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Got it. Now, let’s move on to pricing. What budget do you have in mind for this project?"
                },
                {
                    "participant": "user",
                    "text": "We have a budget of $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "Thanks for that. Next, let’s discuss the timeline. When do you want the project completed?"
                },
                {
                    "participant": "user",
                    "text": "We need the project completed by December."
                },
                {
                    "participant": "assistant",
                    "text": "Based on what we’ve discussed, it seems we have a solid agreement. Shall we move forward to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "Yes, let’s go ahead and finalize the contract."
                },
                {
                    "participant": "assistant",
                    "text": "I understand. If you need any more help, don’t hesitate to reach out. Have a wonderful day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_3_1",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hello! It's great to have this opportunity to discuss the enterprise contract. Where would you like to begin?"
                },
                {
                    "participant": "user",
                    "text": "Hello, I’m all set to discuss the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Fantastic, let’s go over the scope of the contract. What are your key requirements?"
                },
                {
                    "participant": "user",
                    "text": "These are our main requirements."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Next, let’s discuss the pricing. What budget have you set aside for this project?"
                },
                {
                    "participant": "user",
                    "text": "Can we modify the budget?"
                },
                {
                    "participant": "assistant",
                    "text": "Are you looking to change the pricing details?"
                },
                {
                    "participant": "user",
                    "text": "After some thought, we want to establish the budget at $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Let’s talk about pricing. What is the budget you’ve allocated for this project?"
                },
                {
                    "participant": "user",
                    "text": "Our allocated budget is $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "I appreciate that. Now, let’s talk about the timeline. By when do you need the project finished?"
                },
                {
                    "participant": "user",
                    "text": "The project needs to be done by December."
                },
                {
                    "participant": "assistant",
                    "text": "From our conversation, I think we have a strong agreement. Are we ready to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "Absolutely, let’s complete the contract."
                },
                {
                    "participant": "assistant",
                    "text": "I see. Should you require any further assistance, feel free to get in touch. Have a great day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_3_2",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Greetings! I'm happy we can talk about the enterprise contract today. How shall we kick things off?"
                },
                {
                    "participant": "user",
                    "text": "Hi there, I'm ready to talk about the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Excellent, let’s discuss what’s included in the contract. Could you specify your main requirements?"
                },
                {
                    "participant": "user",
                    "text": "Let me outline our primary requirements."
                },
                {
                    "participant": "assistant",
                    "text": "Alright, let’s move on to pricing. How much have you allocated for this project?"
                },
                {
                    "participant": "user",
                    "text": "I’d like to make a change to the budget, if that’s okay."
                },
                {
                    "participant": "assistant",
                    "text": "Do you want to make any adjustments to the pricing terms?"
                },
                {
                    "participant": "user",
                    "text": "Having reconsidered, we’d like to adjust the budget to $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Alright, let’s discuss the pricing. How much budget do you have for this project?"
                },
                {
                    "participant": "user",
                    "text": "We’re looking at a budget of $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "Thank you. Next, let’s cover the timeline. When should we aim to complete the project?"
                },
                {
                    "participant": "user",
                    "text": "We’re aiming to finish the project by December."
                },
                {
                    "participant": "assistant",
                    "text": "It looks like we have a good agreement based on our talks. Should we proceed with finalizing the contract?"
                },
                {
                    "participant": "user",
                    "text": "Yes, I’m ready to finalize the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Got it. If you need any additional support, just let me know. Wishing you a fantastic day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_4_0",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hi there! I'm pleased we can talk about the enterprise contract today. How would you like to kick things off?"
                },
                {
                    "participant": "user",
                    "text": "Hi, I'm all set to discuss the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Excellent, let's delve into the contract's scope. Can you detail your key requirements?"
                },
                {
                    "participant": "user",
                    "text": "Actually, is it possible to adjust the scope of the contract?"
                },
                {
                    "participant": "assistant",
                    "text": "Are you looking to adjust the scope of the contract?"
                },
                {
                    "participant": "user",
                    "text": "We need to include additional features."
                },
                {
                    "participant": "assistant",
                    "text": "Fantastic! Let's go back to discussing the contract's scope. Can you provide an overview of your primary requirements?"
                },
                {
                    "participant": "user",
                    "text": "Here are the main requirements we have."
                },
                {
                    "participant": "assistant",
                    "text": "Got it. Now, let's talk about pricing. What budget do you have set for this project?"
                },
                {
                    "participant": "user",
                    "text": "Our budget stands at $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "Thank you for that information. Next, let's discuss the timeline. When should the project be completed?"
                },
                {
                    "participant": "user",
                    "text": "We need the project completed by December."
                },
                {
                    "participant": "assistant",
                    "text": "Based on our conversation, I think we have a solid agreement. Shall we move forward to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "Yes, let's go ahead and finalize the contract."
                },
                {
                    "participant": "assistant",
                    "text": "I understand. If you require any more help, don't hesitate to reach out. Have a wonderful day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_4_1",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hello! It's great that we can discuss the enterprise contract today. What would you like to start with?"
                },
                {
                    "participant": "user",
                    "text": "Hello, I'm prepared to go over the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Fantastic! Let's go over the scope of the contract. Could you share your primary needs?"
                },
                {
                    "participant": "user",
                    "text": "Can I request a change to the contract's scope?"
                },
                {
                    "participant": "assistant",
                    "text": "Would you like to make changes to the scope of the contract?"
                },
                {
                    "participant": "user",
                    "text": "We would like to add several more features."
                },
                {
                    "participant": "assistant",
                    "text": "Great! Let's revisit the scope of the contract. What are the key requirements you have?"
                },
                {
                    "participant": "user",
                    "text": "I’d like to present our main requirements."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Let’s move on to pricing. What budget have you allocated for this project?"
                },
                {
                    "participant": "user",
                    "text": "We have allocated $100,000 for this project."
                },
                {
                    "participant": "assistant",
                    "text": "I appreciate that. Now, let’s discuss the timeline. When do you expect the project to be done?"
                },
                {
                    "participant": "user",
                    "text": "The project needs to be finished by December."
                },
                {
                    "participant": "assistant",
                    "text": "From what we've discussed, I believe we've reached a good agreement. Are you ready to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "Absolutely, let's finalize the contract."
                },
                {
                    "participant": "assistant",
                    "text": "I get it. Should you need any further assistance, feel free to contact me. Have a great day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_4_2",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hi! I'm happy we're having this conversation about the enterprise contract. How do you want to begin?"
                },
                {
                    "participant": "user",
                    "text": "Hi there, I'm ready to talk about the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Awesome! Let's talk about the scope of the contract. What are your main requirements?"
                },
                {
                    "participant": "user",
                    "text": "Is there any way I can modify the scope of the contract?"
                },
                {
                    "participant": "assistant",
                    "text": "Do you want to revise the contract's scope?"
                },
                {
                    "participant": "user",
                    "text": "It's important for us to add extra features."
                },
                {
                    "participant": "assistant",
                    "text": "Awesome! Let's return to the scope of the contract. Could you summarize your main requirements?"
                },
                {
                    "participant": "user",
                    "text": "These are our key requirements."
                },
                {
                    "participant": "assistant",
                    "text": "I see. Now, let’s discuss the budget. How much have you set aside for this project?"
                },
                {
                    "participant": "user",
                    "text": "Our budget is set at $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "Thanks for sharing. Next, we should talk about the timeline. By when do you need the project finished?"
                },
                {
                    "participant": "user",
                    "text": "We would like the project to be done by December."
                },
                {
                    "participant": "assistant",
                    "text": "Considering our discussions, it seems we have a strong agreement. Shall we proceed to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "Yes, I’m in favor of finalizing the contract."
                },
                {
                    "participant": "assistant",
                    "text": "I see. If there's anything else you need, just let me know. Have an excellent day!"
                }
            ]
        }
    ],
    "dialogues": [
        {
            "id": "Negotiating enterprise contracts._1_0",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hello! I’m glad we can discuss the enterprise contract today. How would you like to begin?"
                },
                {
                    "participant": "user",
                    "text": "Hello, I’m ready to discuss the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Great, let's discuss the scope of the contract. Could you outline your main requirements?"
                },
                {
                    "participant": "user",
                    "text": "Here are our main requirements."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Let's talk about pricing. What budget have you allocated for this project?"
                },
                {
                    "participant": "user",
                    "text": "Actually, can I change the budget?"
                },
                {
                    "participant": "assistant",
                    "text": "Would you like to adjust the pricing terms?"
                },
                {
                    "participant": "user",
                    "text": "We can increase the budget to $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Let's talk about pricing. What budget have you allocated for this project?"
                },
                {
                    "participant": "user",
                    "text": "Our budget is $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "Appreciate that. Next, let's discuss the timeline. By when should the project be finished?"
                },
                {
                    "participant": "user",
                    "text": "We need the project done by December."
                },
                {
                    "participant": "assistant",
                    "text": "Based on our discussions, I believe we have a solid agreement. Shall we proceed to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "Yes, let's finalize the contract."
                },
                {
                    "participant": "assistant",
                    "text": "I understand. If you need any further assistance, feel free to reach out. Have a great day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_1",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hello! I’m glad we can discuss the enterprise contract today. How would you like to begin?"
                },
                {
                    "participant": "user",
                    "text": "Hello, I’m ready to discuss the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Great, let's discuss the scope of the contract. Could you outline your main requirements?"
                },
                {
                    "participant": "user",
                    "text": "Here are our main requirements."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Let's talk about pricing. What budget have you allocated for this project?"
                },
                {
                    "participant": "user",
                    "text": "Actually, can I change the budget?"
                },
                {
                    "participant": "assistant",
                    "text": "Would you like to adjust the pricing terms?"
                },
                {
                    "participant": "user",
                    "text": "We can increase the budget to $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Let's talk about pricing. What budget have you allocated for this project?"
                },
                {
                    "participant": "user",
                    "text": "Our budget is $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "Appreciate that. Next, let's discuss the timeline. By when should the project be finished?"
                },
                {
                    "participant": "user",
                    "text": "We need the project done by December."
                },
                {
                    "participant": "assistant",
                    "text": "Based on our discussions, I believe we have a solid agreement. Shall we proceed to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "I have to exit this negotiation now."
                },
                {
                    "participant": "assistant",
                    "text": "I understand. If you need any further assistance, feel free to reach out. Have a great day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_2",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hello! I’m glad we can discuss the enterprise contract today. How would you like to begin?"
                },
                {
                    "participant": "user",
                    "text": "Hello, I’m ready to discuss the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Great, let's discuss the scope of the contract. Could you outline your main requirements?"
                },
                {
                    "participant": "user",
                    "text": "Here are our main requirements."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Let's talk about pricing. What budget have you allocated for this project?"
                },
                {
                    "participant": "user",
                    "text": "Actually, can I change the budget?"
                },
                {
                    "participant": "assistant",
                    "text": "Would you like to adjust the pricing terms?"
                },
                {
                    "participant": "user",
                    "text": "We can increase the budget to $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Let's talk about pricing. What budget have you allocated for this project?"
                },
                {
                    "participant": "user",
                    "text": "Our budget is $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "Thank you. Now, let's set a timeline. When do you expect the project to be completed?"
                },
                {
                    "participant": "user",
                    "text": "We need the project done by December."
                },
                {
                    "participant": "assistant",
                    "text": "Based on our discussions, I believe we have a solid agreement. Shall we proceed to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "Yes, let's finalize the contract."
                },
                {
                    "participant": "assistant",
                    "text": "I understand. If you need any further assistance, feel free to reach out. Have a great day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_3",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hello! I’m glad we can discuss the enterprise contract today. How would you like to begin?"
                },
                {
                    "participant": "user",
                    "text": "Hello, I’m ready to discuss the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Great, let's discuss the scope of the contract. Could you outline your main requirements?"
                },
                {
                    "participant": "user",
                    "text": "Here are our main requirements."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Let's talk about pricing. What budget have you allocated for this project?"
                },
                {
                    "participant": "user",
                    "text": "Actually, can I change the budget?"
                },
                {
                    "participant": "assistant",
                    "text": "Would you like to adjust the pricing terms?"
                },
                {
                    "participant": "user",
                    "text": "After reconsidering, we’d like to set the budget at $120,000."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Let's talk about pricing. What budget have you allocated for this project?"
                },
                {
                    "participant": "user",
                    "text": "Our budget is $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "Appreciate that. Next, let's discuss the timeline. By when should the project be finished?"
                },
                {
                    "participant": "user",
                    "text": "We need the project done by December."
                },
                {
                    "participant": "assistant",
                    "text": "Based on our discussions, I believe we have a solid agreement. Shall we proceed to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "Yes, let's finalize the contract."
                },
                {
                    "participant": "assistant",
                    "text": "I understand. If you need any further assistance, feel free to reach out. Have a great day!"
                }
            ]
        },
        {
            "id": "Negotiating enterprise contracts._1_4",
            "messages": [
                {
                    "participant": "assistant",
                    "text": "Hello! I’m glad we can discuss the enterprise contract today. How would you like to begin?"
                },
                {
                    "participant": "user",
                    "text": "Hello, I’m ready to discuss the contract."
                },
                {
                    "participant": "assistant",
                    "text": "Great, let's discuss the scope of the contract. Could you outline your main requirements?"
                },
                {
                    "participant": "user",
                    "text": "Actually, can I change the scope of the contract?"
                },
                {
                    "participant": "assistant",
                    "text": "Would you like to modify the scope of the contract?"
                },
                {
                    "participant": "user",
                    "text": "We need to add more features."
                },
                {
                    "participant": "assistant",
                    "text": "Great, let's discuss the scope of the contract. Could you outline your main requirements?"
                },
                {
                    "participant": "user",
                    "text": "Here are our main requirements."
                },
                {
                    "participant": "assistant",
                    "text": "Understood. Let's talk about pricing. What budget have you allocated for this project?"
                },
                {
                    "participant": "user",
                    "text": "Our budget is $100,000."
                },
                {
                    "participant": "assistant",
                    "text": "Appreciate that. Next, let's discuss the timeline. By when should the project be finished?"
                },
                {
                    "participant": "user",
                    "text": "We need the project done by December."
                },
                {
                    "participant": "assistant",
                    "text": "Based on our discussions, I believe we have a solid agreement. Shall we proceed to finalize the contract?"
                },
                {
                    "participant": "user",
                    "text": "Yes, let's finalize the contract."
                },
                {
                    "participant": "assistant",
                    "text": "I understand. If you need any further assistance, feel free to reach out. Have a great day!"
                }
            ]
        }
    ],
    "graph": {
        "edges": [
            {
                "source": 1,
                "target": 2,
                "utterances": [
                    "Hello, I'm set to discuss the contract.",
                    "Hi there, I'm ready to talk about the contract.",
                    "Hello, I'm prepared to go over the contract.",
                    "Hello, I'm prepared to go over the contract details.",
                    "Hello, I’m ready to discuss the contract.",
                    "Hi, I’m prepared to go through the contract.",
                    "Hello, I’m all set to discuss the contract.",
                    "Hi there, I'm ready to dive into the contract discussion.",
                    "Hi, I'm all set to talk about the contract.",
                    "Hi, I'm prepared to go over the contract.",
                    "Hi, I'm all set to discuss the contract."
                ]
            },
            {
                "source": 2,
                "target": 3,
                "utterances": [
                    "Let me outline our primary requirements.",
                    "These are the primary requirements from our side.",
                    "Here are our main requirements.",
                    "Here are the main requirements we have.",
                    "Here are the key requirements we have.",
                    "I’d like to present our main requirements now.",
                    "Let me outline our main requirements for you.",
                    "I’d like to present our main requirements.",
                    "Here’s what we need from the contract.",
                    "Let me outline our main needs.",
                    "These are our primary requirements.",
                    "These are our key requirements.",
                    "These are our main requirements."
                ]
            },
            {
                "source": 2,
                "target": 7,
                "utterances": [
                    "Can I request a change to the contract's scope?",
                    "Is there any way I can modify the scope of the contract?",
                    "Actually, is it possible to adjust the scope of the contract?",
                    "Actually, can I change the scope of the contract?"
                ]
            },
            {
                "source": 7,
                "target": 2,
                "utterances": [
                    "It's important for us to add extra features.",
                    "We need to include additional features.",
                    "We need to add more features.",
                    "We would like to add several more features."
                ]
            },
            {
                "source": 3,
                "target": 4,
                "utterances": [
                    "The budget we’re working with is $100,000.",
                    "Our budget stands at $100,000.",
                    "We have allocated $100,000 for this project.",
                    "Our budget is set at $100,000.",
                    "We have a budget of $100,000.",
                    "Our budget is $100,000.",
                    "We have allocated $100,000 for the budget.",
                    "The budget we have is $100,000.",
                    "Our allocated budget is $100,000.",
                    "We’re looking at a budget of $100,000."
                ]
            },
            {
                "source": 3,
                "target": 6,
                "utterances": [
                    "Can I modify the budget, please?",
                    "I’d like to make a change to the budget, if that’s okay.",
                    "Can we modify the budget?",
                    "I’d like to make a change to the budget, if that's okay.",
                    "Is it possible to modify the budget?",
                    "Actually, can I change the budget?",
                    "Actually, is it possible to modify the budget?",
                    "Can I revise the budget, actually?",
                    "Actually, is it possible to adjust the budget?",
                    "Would it be alright if I changed the budget?",
                    "Actually, is it possible to revise the budget?",
                    "Can I adjust the budget amount?",
                    "Would it be alright if I adjusted the budget?"
                ]
            },
            {
                "source": 6,
                "target": 3,
                "utterances": [
                    "We can increase the budget to $120,000.",
                    "Upon reflection, we’d like to set the budget to $120,000.",
                    "Let’s adjust the budget to $120,000.",
                    "We're able to boost the budget to $120,000.",
                    "After some thought, we want to establish the budget at $120,000.",
                    "We can raise the budget to $120,000.",
                    "The new budget can be set at $120,000.",
                    "I can increase the budget to $120,000.",
                    "Having reconsidered, we’d like to adjust the budget to $120,000.",
                    "We're able to increase the budget to $120,000.",
                    "After reconsidering, we’d like to set the budget at $120,000.",
                    "We're willing to increase the budget to $120,000."
                ]
            },
            {
                "source": 4,
                "target": 5,
                "utterances": [
                    "We require the project to be finished by December.",
                    "We require the project to be completed by December.",
                    "We’re aiming to finish the project by December.",
                    "We would like the project to be done by December.",
                    "We need the project completed by December.",
                    "The deadline for the project is December.",
                    "We aim to have the project done by December.",
                    "We're aiming to finalize the project by December.",
                    "We need the project done by December.",
                    "The project needs to be finished by December.",
                    "The project needs to be finalized by December.",
                    "We need to have the project completed by December.",
                    "The project needs to be done by December."
                ]
            },
            {
                "source": 5,
                "target": 8,
                "utterances": [
                    "I have to exit this negotiation now.",
                    "I have to leave this negotiation at this point.",
                    "Yes, let's go ahead and finalize the contract.",
                    "I must exit this negotiation for now.",
                    "Absolutely, let's wrap up and finalize the contract.",
                    "Yes, let's finalize the contract.",
                    "Absolutely, I'm ready to finalize the contract.",
                    "Yes, I’m in favor of finalizing the contract.",
                    "Yes, let’s go ahead and finalize the contract.",
                    "Absolutely, let’s complete the contract.",
                    "Yes, I’m ready to finalize the contract.",
                    "I need to step out of this negotiation now.",
                    "Absolutely, let's finalize the contract.",
                    "Yes, I'm ready to finalize the contract.",
                    "Sure, let’s complete the contract finalization."
                ]
            }
        ],
        "nodes": [
            {
                "id": 1,
                "is_start": true,
                "label": "greeting",
                "utterances": [
                    "Hello! I’m happy to be discussing the enterprise contract with you. How do you want to kick things off?",
                    "Hi! I'm happy we're having this conversation about the enterprise contract. How do you want to begin?",
                    "Hello! I'm happy to have this conversation about the enterprise contract. Where would you like to kick things off?",
                    "Greetings! I'm excited to discuss the enterprise contract with you today. What would you like to begin with?",
                    "Hi there! I'm pleased we can go over the enterprise contract today. How would you like to start?",
                    "Hi there! I'm glad we can chat about the enterprise contract today. How would you like to kick things off?",
                    "Hello! It's great to have this opportunity to discuss the enterprise contract. Where would you like to begin?",
                    "Hi there! I'm pleased we can go over the enterprise contract today. Where would you like to start?",
                    "Greetings! I’m excited to talk about the enterprise contract today. What would you like to begin with?",
                    "Hello! It's great that we can discuss the enterprise contract today. What would you like to start with?",
                    "Hello! I’m glad we can discuss the enterprise contract today. How would you like to begin?",
                    "Greetings! I'm happy we can talk about the enterprise contract today. How shall we kick things off?",
                    "Hi! I'm happy to discuss the enterprise contract today. Where would you like to begin?",
                    "Hello! I'm pleased we can go over the enterprise contract. What would you like to start with?",
                    "Hi there! I'm pleased we can talk about the enterprise contract today. How would you like to kick things off?"
                ]
            },
            {
                "id": 2,
                "is_start": false,
                "label": "discuss_scope",
                "utterances": [
                    "Great! Let's revisit the scope of the contract. What are the key requirements you have?",
                    "Awesome, let’s dive into the contract's scope. Can you share your primary requirements?",
                    "Great, let’s talk about what the contract will cover. Could you detail your main requirements?",
                    "Perfect, let's discuss the details of the contract. What are your main requirements?",
                    "Excellent, let's delve into the contract's scope. Can you detail your key requirements?",
                    "Fantastic! Let's go back to discussing the contract's scope. Can you provide an overview of your primary requirements?",
                    "Great, let's discuss the scope of the contract. Could you outline your main requirements?",
                    "Great! Let's take a look at the contract's scope. Could you detail your primary needs?",
                    "Excellent, let’s discuss what’s included in the contract. Could you specify your main requirements?",
                    "Fantastic! Let's go over the scope of the contract. Could you share your primary needs?",
                    "Awesome! Let's talk about the scope of the contract. What are your main requirements?",
                    "Perfect, let's talk about the scope. Could you outline your key requirements?",
                    "Fantastic, let’s go over the scope of the contract. What are your key requirements?",
                    "Awesome, let’s go over the scope of the contract. Can you share your primary requirements?",
                    "Awesome, let’s dive into the details of the contract. Can you share your key requirements?",
                    "Awesome! Let's return to the scope of the contract. Could you summarize your main requirements?",
                    "Fantastic, let’s get into the scope of the contract. What are your primary needs?",
                    "Great! Let's discuss the contract's scope. What are your main needs?",
                    "Awesome, let's go over the scope of the contract. Can you share your key requirements?"
                ]
            },
            {
                "id": 3,
                "is_start": false,
                "label": "discuss_pricing",
                "utterances": [
                    "Understood. Next, let’s discuss the pricing. What budget are you considering for this project?",
                    "Understood. Let's revisit the pricing. How much have you allocated for this project?",
                    "Understood. Let’s return to the pricing discussion. How much have you budgeted for this project?",
                    "Understood. Next, let’s discuss the pricing. What budget have you set aside for this project?",
                    "Alright, let’s move on to pricing. How much have you allocated for this project?",
                    "Got it. Now, let's discuss the pricing. How much have you budgeted for this project?",
                    "Alright, let's go back to pricing. What budget do you have in mind for this project?",
                    "Understood. Let's move on to the pricing aspect. What budget have you planned for this project?",
                    "Got it. Now, let’s revisit the pricing. What budget have you set for this project?",
                    "Understood. Next, let’s talk about the budget. What financial range are you considering for this project?",
                    "Got it. Now, let's talk about pricing. What budget do you have set for this project?",
                    "Understood. Let’s discuss the pricing now. What budget have you allocated for this project?",
                    "Okay, let’s address the pricing. What budget are we looking at for this project?",
                    "Got it. Now, let's address pricing. What budget do you have set aside for this project?",
                    "Okay, let’s talk about costs. What budget have you set aside for this project?",
                    "Got it. Now, let’s talk about pricing. What budget do you have in mind for this project?",
                    "I see. Now, let’s discuss the budget. How much have you set aside for this project?",
                    "Okay, let's talk about the pricing. How much budget do you have allocated for this project?",
                    "Got it. Now, let’s discuss the pricing again. What budget have you set for this project?",
                    "Understood. Let’s talk about pricing. What is the budget you’ve allocated for this project?",
                    "Okay, let’s move on to pricing. What budget do you have in mind for this project?",
                    "Understood. Let’s move on to pricing. What budget have you allocated for this project?",
                    "Okay, let’s talk about the budget once more. What is the financial range you’re working with?",
                    "Understood. Let's talk about pricing. What budget have you allocated for this project?",
                    "Alright, let’s discuss the pricing. How much budget do you have for this project?",
                    "Got it. Now, let’s move on to pricing. What budget do you have in mind for this project?"
                ]
            },
            {
                "id": 4,
                "is_start": false,
                "label": "discuss_timeline",
                "utterances": [
                    "I appreciate that. Now, let’s talk about the timeline. By when do you need the project finished?",
                    "I appreciate that. Now, let’s talk about the timeline. By what date do you need this project finished?",
                    "Thank you. Now, let's set a timeline. When do you expect the project to be completed?",
                    "I appreciate that. Let’s discuss the timeline. When should we aim to finish the project?",
                    "Thanks for sharing. Now, let’s discuss the timeline. When do you expect the project to wrap up?",
                    "Thank you. Next, let’s cover the timeline. When should we aim to complete the project?",
                    "I appreciate that. Now, let’s talk about the timeline. By when do you want the project finished?",
                    "Thank you for that information. Next, let's discuss the timeline. When should the project be completed?",
                    "Thanks for that. Next, let’s discuss the timeline. When do you want the project completed?",
                    "Thank you for that. Next, let's talk about the timeline. When do you need the project completed?",
                    "I appreciate that. Now, let’s discuss the timeline. When do you expect the project to be done?",
                    "Thank you for that. Now, let’s establish a timeline. When do you plan for the project to be completed?",
                    "Appreciate that. Next, let's discuss the timeline. By when should the project be finished?",
                    "Thank you for that information. Let’s move on to the timeline. When should the project be wrapped up?",
                    "Thanks for sharing that. Now, let’s move on to the timeline. When do you expect the project to be done?",
                    "Thanks for sharing. Next, let’s discuss the timeline. When do you need the project completed?",
                    "Thanks for sharing. Next, we should talk about the timeline. By when do you need the project finished?"
                ]
            },
            {
                "id": 5,
                "is_start": false,
                "label": "confirm_agreement",
                "utterances": [
                    "From what we've discussed, I believe we've reached a good agreement. Are you ready to finalize the contract?",
                    "Considering our discussions, it seems we have a strong agreement. Shall we proceed to finalize the contract?",
                    "It looks like we have a strong agreement based on our talks. Should we proceed to finalize the contract?",
                    "From our conversation, it seems we have a good agreement in place. Shall we proceed to finalize the contract?",
                    "From what we've discussed, it seems we have a good agreement. Are you ready to finalize the contract?",
                    "From our conversation, I think we have a strong agreement. Are we ready to finalize the contract?",
                    "Based on our conversation, I think we have a solid agreement. Shall we move forward with finalizing the contract?",
                    "Based on what we've discussed, I think we have a solid agreement. Should we move forward with finalizing the contract?",
                    "Based on our conversation, I think we have a solid agreement. Should we move forward to finalize the contract?",
                    "From what we've discussed, I believe we have a strong agreement. Are you ready to finalize the contract?",
                    "Given our discussion, I believe we have a strong agreement. Are we ready to finalize the contract?",
                    "Based on our conversation, I think we have a solid agreement. Shall we move forward to finalize the contract?",
                    "Based on what we’ve discussed, it seems we have a solid agreement. Shall we move forward to finalize the contract?",
                    "It seems we have a good agreement based on our discussions. Shall we proceed with finalizing the contract?",
                    "It looks like we have a good agreement based on our talks. Should we proceed with finalizing the contract?",
                    "Based on our discussions, I believe we have a solid agreement. Shall we proceed to finalize the contract?"
                ]
            },
            {
                "id": 6,
                "is_start": false,
                "label": "modify_pricing",
                "utterances": [
                    "Would you like to adjust the pricing terms?",
                    "Would you like to modify the pricing agreement?",
                    "Are you looking to modify the pricing details?",
                    "Are you looking to change the pricing terms?",
                    "Do you want to make any adjustments to the pricing terms?",
                    "Do you want to change the pricing conditions?",
                    "Are you looking to change the pricing details?",
                    "Do you want to adjust the terms regarding pricing?",
                    "Would you like to modify the pricing details?",
                    "Do you want to change the pricing structure?",
                    "Would you like to revisit the pricing terms?",
                    "Are you looking to revise the pricing terms?",
                    "Would you prefer to revise the pricing terms?"
                ]
            },
            {
                "id": 7,
                "is_start": false,
                "label": "modify_scope",
                "utterances": [
                    "Are you looking to adjust the scope of the contract?",
                    "Do you want to revise the contract's scope?",
                    "Would you like to modify the scope of the contract?",
                    "Would you like to make changes to the scope of the contract?"
                ]
            },
            {
                "id": 8,
                "is_start": false,
                "label": "exit_conversation",
                "utterances": [
                    "No problem at all. If you need any additional support, just let me know. Wishing you a great day!",
                    "I see. Should you require any further assistance, feel free to get in touch. Have a great day!",
                    "Got it. If you require further help, feel free to contact me. Have a great day!",
                    "I understand. If you require any further assistance, don’t hesitate to reach out. Have a wonderful day!",
                    "I get it. Should you need any more help, feel free to contact me. Have a great day!",
                    "I understand. If you have any more questions or need assistance, don't hesitate to reach out. Have a fantastic day!",
                    "Understood. If there's anything else you need, please let me know. Have a wonderful day!",
                    "I understand. If you need any further assistance, feel free to reach out. Have a great day!",
                    "Got it. If you need any additional support, just let me know. Wishing you a fantastic day!",
                    "I see. If there's anything else you need, just let me know. Have an excellent day!",
                    "I understand. If you require any more help, don't hesitate to reach out. Have a wonderful day!",
                    "I understand. If you need any more help, don’t hesitate to reach out. Have a wonderful day!",
                    "I get it. Should you need any further assistance, feel free to contact me. Have a great day!",
                    "I understand. If you need any more assistance, don't hesitate to reach out. Have a wonderful day!",
                    "Understood. If you need anything else, don't hesitate to ask. Wishing you a great day!",
                    "Got it. If you need any additional help, feel free to contact me. Enjoy your day!"
                ]
            }
        ]
    },
    "incremental": {
        "graph_0": {
            "edges": [
                {
                    "source": 1,
                    "target": 2,
                    "utterances": [
                        "hello, i’m ready to discuss the contract."
                    ]
                },
                {
                    "source": 2,
                    "target": 3,
                    "utterances": [
                        "here are our main requirements."
                    ]
                },
                {
                    "source": 3,
                    "target": 4,
                    "utterances": [
                        "actually, can i change the budget?"
                    ]
                },
                {
                    "source": 3,
                    "target": 5,
                    "utterances": [
                        "our budget is $100,000."
                    ]
                },
                {
                    "source": 4,
                    "target": 3,
                    "utterances": [
                        "we can increase the budget to $120,000."
                    ]
                },
                {
                    "source": 5,
                    "target": 6,
                    "utterances": [
                        "we need the project done by december."
                    ]
                },
                {
                    "source": 6,
                    "target": 7,
                    "utterances": [
                        "yes, let's finalize the contract."
                    ]
                }
            ],
            "nodes": [
                {
                    "id": 1,
                    "is_start": true,
                    "label": "start",
                    "utterances": [
                        "Hello! I’m glad we can discuss the enterprise contract today. How would you like to begin?"
                    ]
                },
                {
                    "id": 2,
                    "is_start": false,
                    "label": "discuss_scope",
                    "utterances": [
                        "Great, let's discuss the scope of the contract. Could you outline your main requirements?"
                    ]
                },
                {
                    "id": 3,
                    "is_start": false,
                    "label": "ask_pricing",
                    "utterances": [
                        "Understood. Let's talk about pricing. What budget have you allocated for this project?"
                    ]
                },
                {
                    "id": 4,
                    "is_start": false,
                    "label": "adjust_pricing",
                    "utterances": [
                        "Would you like to adjust the pricing terms?"
                    ]
                },
                {
                    "id": 5,
                    "is_start": false,
                    "label": "ask_timeline",
                    "utterances": [
                        "Appreciate that. Next, let's discuss the timeline. By when should the project be finished?"
                    ]
                },
                {
                    "id": 6,
                    "is_start": false,
                    "label": "confirm_finalization",
                    "utterances": [
                        "Based on our discussions, I believe we have a solid agreement. Shall we proceed to finalize the contract?"
                    ]
                },
                {
                    "id": 7,
                    "is_start": false,
                    "label": "final_message",
                    "utterances": [
                        "I understand. If you need any further assistance, feel free to reach out. Have a great day!"
                    ]
                }
            ],
            "reason": ""
        },
        "graph_1": {
            "edges": [
                {
                    "source": 1,
                    "target": 2,
                    "utterances": [
                        "Hello, I’m ready to discuss the contract."
                    ]
                },
                {
                    "source": 2,
                    "target": 8,
                    "utterances": [
                        "Here are our main requirements."
                    ]
                },
                {
                    "source": 8,
                    "target": 3,
                    "utterances": []
                },
                {
                    "source": 3,
                    "target": 9,
                    "utterances": [
                        "Actually, can I change the budget?"
                    ]
                },
                {
                    "source": 3,
                    "target": 10,
                    "utterances": [
                        "Our budget is $100,000."
                    ]
                },
                {
                    "source": 9,
                    "target": 11,
                    "utterances": [
                        "We can increase the budget to $120,000."
                    ]
                },
                {
                    "source": 3,
                    "target": 5,
                    "utterances": [
                        "Appreciate that. Next, let's discuss the timeline. By when should the project be finished?"
                    ]
                },
                {
                    "source": 5,
                    "target": 6,
                    "utterances": [
                        "We need the project done by December."
                    ]
                },
                {
                    "source": 6,
                    "target": 7,
                    "utterances": [
                        "Yes, let's finalize the contract."
                    ]
                },
                {
                    "source": 6,
                    "target": 12,
                    "utterances": [
                        "I have to exit this negotiation now."
                    ]
                }
            ],
            "nodes": [
                {
                    "id": 1,
                    "is_start": true,
                    "label": "start",
                    "utterances": [
                        "Hello! I’m glad we can discuss the enterprise contract today. How would you like to begin?"
                    ]
                },
                {
                    "id": 2,
                    "is_start": false,
                    "label": "discuss_scope",
                    "utterances": [
                        "Great, let's discuss the scope of the contract. Could you outline your main requirements?"
                    ]
                },
                {
                    "id": 3,
                    "is_start": false,
                    "label": "ask_pricing",
                    "utterances": [
                        "Understood. Let's talk about pricing. What budget have you allocated for this project?"
                    ]
                },
                {
                    "id": 4,
                    "is_start": false,
                    "label": "adjust_pricing",
                    "utterances": [
                        "Would you like to adjust the pricing terms?"
                    ]
                },
                {
                    "id": 5,
                    "is_start": false,
                    "label": "ask_timeline",
                    "utterances": [
                        "Appreciate that. Next, let's discuss the timeline. By when should the project be finished?"
                    ]
                },
                {
                    "id": 6,
                    "is_start": false,
                    "label": "confirm_finalization",
                    "utterances": [
                        "Based on our discussions, I believe we have a solid agreement. Shall we proceed to finalize the contract?"
                    ]
                },
                {
                    "id": 7,
                    "is_start": false,
                    "label": "final_message",
                    "utterances": [
                        "I understand. If you need any further assistance, feel free to reach out. Have a great day!"
                    ]
                },
                {
                    "id": 8,
                    "is_start": false,
                    "label": "provide_requirements",
                    "utterances": [
                        "Here are our main requirements."
                    ]
                },
                {
                    "id": 9,
                    "is_start": false,
                    "label": "request_change_budget",
                    "utterances": [
                        "Actually, can I change the budget?"
                    ]
                },
                {
                    "id": 10,
                    "is_start": false,
                    "label": "set_budget_100k",
                    "utterances": [
                        "Our budget is $100,000."
                    ]
                },
                {
                    "id": 11,
                    "is_start": false,
                    "label": "set_budget_120k",
                    "utterances": [
                        "We can increase the budget to $120,000."
                    ]
                },
                {
                    "id": 12,
                    "is_start": false,
                    "label": "exit_negotiation",
                    "utterances": [
                        "I have to exit this negotiation now."
                    ]
                }
            ]
        },
        "graph_2": {
            "edges": [
                {
                    "source": 1,
                    "target": 2,
                    "utterances": [
                        "Hello, I’m ready to discuss the contract."
                    ]
                },
                {
                    "source": 2,
                    "target": 8,
                    "utterances": [
                        "Here are our main requirements."
                    ]
                },
                {
                    "source": 8,
                    "target": 3,
                    "utterances": []
                },
                {
                    "source": 3,
                    "target": 9,
                    "utterances": [
                        "Actually, can I change the budget?"
                    ]
                },
                {
                    "source": 3,
                    "target": 10,
                    "utterances": [
                        "Our budget is $100,000."
                    ]
                },
                {
                    "source": 9,
                    "target": 11,
                    "utterances": [
                        "We can increase the budget to $120,000."
                    ]
                },
                {
                    "source": 3,
                    "target": 5,
                    "utterances": [
                        "Thank you. Now, let's set a timeline. When do you expect the project to be completed?"
                    ]
                },
                {
                    "source": 5,
                    "target": 6,
                    "utterances": [
                        "We need the project done by December."
                    ]
                },
                {
                    "source": 6,
                    "target": 7,
                    "utterances": [
                        "Yes, let's finalize the contract."
                    ]
                },
                {
                    "source": 6,
                    "target": 12,
                    "utterances": []
                }
            ],
            "nodes": [
                {
                    "id": 1,
                    "is_start": true,
                    "label": "start",
                    "utterances": [
                        "Hello! I’m glad we can discuss the enterprise contract today. How would you like to begin?"
                    ]
                },
                {
                    "id": 2,
                    "is_start": false,
                    "label": "discuss_scope",
                    "utterances": [
                        "Great, let's discuss the scope of the contract. Could you outline your main requirements?"
                    ]
                },
                {
                    "id": 3,
                    "is_start": false,
                    "label": "ask_pricing",
                    "utterances": [
                        "Understood. Let's talk about pricing. What budget have you allocated for this project?"
                    ]
                },
                {
                    "id": 4,
                    "is_start": false,
                    "label": "adjust_pricing",
                    "utterances": [
                        "Would you like to adjust the pricing terms?"
                    ]
                },
                {
                    "id": 5,
                    "is_start": false,
                    "label": "ask_timeline",
                    "utterances": [
                        "Appreciate that. Next, let's discuss the timeline. By when should the project be finished?",
                        "Thank you. Now, let's set a timeline. When do you expect the project to be completed?"
                    ]
                },
                {
                    "id": 6,
                    "is_start": false,
                    "label": "confirm_finalization",
                    "utterances": [
                        "Based on our discussions, I believe we have a solid agreement. Shall we proceed to finalize the contract?"
                    ]
                },
                {
                    "id": 7,
                    "is_start": false,
                    "label": "final_message",
                    "utterances": [
                        "I understand. If you need any further assistance, feel free to reach out. Have a great day!"
                    ]
                },
                {
                    "id": 8,
                    "is_start": false,
                    "label": "provide_requirements",
                    "utterances": [
                        "Here are our main requirements."
                    ]
                },
                {
                    "id": 9,
                    "is_start": false,
                    "label": "request_change_budget",
                    "utterances": [
                        "Actually, can I change the budget?"
                    ]
                },
                {
                    "id": 10,
                    "is_start": false,
                    "label": "set_budget_100k",
                    "utterances": [
                        "Our budget is $100,000."
                    ]
                },
                {
                    "id": 11,
                    "is_start": false,
                    "label": "set_budget_120k",
                    "utterances": [
                        "We can increase the budget to $120,000."
                    ]
                },
                {
                    "id": 12,
                    "is_start": false,
                    "label": "exit_negotiation",
                    "utterances": []
                }
            ]
        },
        "graph_3": {
            "edges": [
                {
                    "source": 1,
                    "target": 2,
                    "utterances": [
                        "Hello, I’m ready to discuss the contract."
                    ]
                },
                {
                    "source": 2,
                    "target": 8,
                    "utterances": [
                        "Here are our main requirements."
                    ]
                },
                {
                    "source": 8,
                    "target": 3,
                    "utterances": []
                },
                {
                    "source": 3,
                    "target": 9,
                    "utterances": [
                        "Actually, can I change the budget?"
                    ]
                },
                {
                    "source": 3,
                    "target": 10,
                    "utterances": [
                        "Our budget is $100,000."
                    ]
                },
                {
                    "source": 9,
                    "target": 11,
                    "utterances": [
                        "After reconsidering, we’d like to set the budget at $120,000."
                    ]
                },
                {
                    "source": 3,
                    "target": 5,
                    "utterances": [
                        "Thank you. Now, let's set a timeline. When do you expect the project to be completed?"
                    ]
                },
                {
                    "source": 5,
                    "target": 6,
                    "utterances": [
                        "We need the project done by December."
                    ]
                },
                {
                    "source": 6,
                    "target": 7,
                    "utterances": [
                        "Yes, let's finalize the contract."
                    ]
                },
                {
                    "source": 6,
                    "target": 12,
                    "utterances": []
                },
                {
                    "source": 4,
                    "target": 3,
                    "utterances": [
                        "Would you like to adjust the pricing terms?"
                    ]
                }
            ],
            "nodes": [
                {
                    "id": 1,
                    "is_start": true,
                    "label": "start",
                    "utterances": [
                        "Hello! I’m glad we can discuss the enterprise contract today. How would you like to begin?"
                    ]
                },
                {
                    "id": 2,
                    "is_start": false,
                    "label": "discuss_scope",
                    "utterances": [
                        "Great, let's discuss the scope of the contract. Could you outline your main requirements?"
                    ]
                },
                {
                    "id": 3,
                    "is_start": false,
                    "label": "ask_pricing",
                    "utterances": [
                        "Understood. Let's talk about pricing. What budget have you allocated for this project?"
                    ]
                },
                {
                    "id": 4,
                    "is_start": false,
                    "label": "adjust_pricing",
                    "utterances": [
                        "Would you like to adjust the pricing terms?"
                    ]
                },
                {
                    "id": 5,
                    "is_start": false,
                    "label": "ask_timeline",
                    "utterances": [
                        "Appreciate that. Next, let's discuss the timeline. By when should the project be finished?",
                        "Thank you. Now, let's set a timeline. When do you expect the project to be completed?"
                    ]
                },
                {
                    "id": 6,
                    "is_start": false,
                    "label": "confirm_finalization",
                    "utterances": [
                        "Based on our discussions, I believe we have a solid agreement. Shall we proceed to finalize the contract?"
                    ]
                },
                {
                    "id": 7,
                    "is_start": false,
                    "label": "final_message",
                    "utterances": [
                        "I understand. If you need any further assistance, feel free to reach out. Have a great day!"
                    ]
                },
                {
                    "id": 8,
                    "is_start": false,
                    "label": "provide_requirements",
                    "utterances": [
                        "Here are our main requirements."
                    ]
                },
                {
                    "id": 9,
                    "is_start": false,
                    "label": "request_change_budget",
                    "utterances": [
                        "Actually, can I change the budget?"
                    ]
                },
                {
                    "id": 10,
                    "is_start": false,
                    "label": "set_budget_100k",
                    "utterances": [
                        "Our budget is $100,000."
                    ]
                },
                {
                    "id": 11,
                    "is_start": false,
                    "label": "set_budget_120k",
                    "utterances": [
                        "We can increase the budget to $120,000.",
                        "After reconsidering, we’d like to set the budget at $120,000."
                    ]
                },
                {
                    "id": 12,
                    "is_start": false,
                    "label": "exit_negotiation",
                    "utterances": []
                }
            ]
        },
        "graph_4": {
            "edges": [
                {
                    "source": 1,
                    "target": 2,
                    "utterances": [
                        "Hello, I’m ready to discuss the contract."
                    ]
                },
                {
                    "source": 2,
                    "target": 8,
                    "utterances": [
                        "Here are our main requirements."
                    ]
                },
                {
                    "source": 2,
                    "target": 4,
                    "utterances": [
                        "Actually, can I change the scope of the contract?"
                    ]
                },
                {
                    "source": 4,
                    "target": 3,
                    "utterances": [
                        "Would you like to modify the scope of the contract?"
                    ]
                },
                {
                    "source": 4,
                    "target": 8,
                    "utterances": [
                        "Actually, can I change the scope of the contract?"
                    ]
                },
                {
                    "source": 8,
                    "target": 3,
                    "utterances": []
                },
                {
                    "source": 3,
                    "target": 9,
                    "utterances": [
                        "Actually, can I change the budget?"
                    ]
                },
                {
                    "source": 3,
                    "target": 10,
                    "utterances": [
                        "Our budget is $100,000."
                    ]
                },
                {
                    "source": 9,
                    "target": 11,
                    "utterances": [
                        "After reconsidering, we’d like to set the budget at $120,000."
                    ]
                },
                {
                    "source": 3,
                    "target": 5,
                    "utterances": [
                        "Thank you. Now, let's set a timeline. When do you expect the project to be completed?"
                    ]
                },
                {
                    "source": 5,
                    "target": 6,
                    "utterances": [
                        "We need the project done by December."
                    ]
                },
                {
                    "source": 6,
                    "target": 7,
                    "utterances": [
                        "Yes, let's finalize the contract."
                    ]
                },
                {
                    "source": 6,
                    "target": 12,
                    "utterances": []
                }
            ],
            "nodes": [
                {
                    "id": 1,
                    "is_start": true,
                    "label": "start",
                    "utterances": [
                        "Hello! I’m glad we can discuss the enterprise contract today. How would you like to begin?"
                    ]
                },
                {
                    "id": 2,
                    "is_start": false,
                    "label": "discuss_scope",
                    "utterances": [
                        "Great, let's discuss the scope of the contract. Could you outline your main requirements?"
                    ]
                },
                {
                    "id": 3,
                    "is_start": false,
                    "label": "ask_pricing",
                    "utterances": [
                        "Understood. Let's talk about pricing. What budget have you allocated for this project?"
                    ]
                },
                {
                    "id": 4,
                    "is_start": false,
                    "label": "adjust_pricing",
                    "utterances": [
                        "Would you like to adjust the pricing terms?",
                        "Would you like to modify the scope of the contract?"
                    ]
                },
                {
                    "id": 5,
                    "is_start": false,
                    "label": "ask_timeline",
                    "utterances": [
                        "Appreciate that. Next, let's discuss the timeline. By when should the project be finished?",
                        "Thank you. Now, let's set a timeline. When do you expect the project to be completed?"
                    ]
                },
                {
                    "id": 6,
                    "is_start": false,
                    "label": "confirm_finalization",
                    "utterances": [
                        "Based on our discussions, I believe we have a solid agreement. Shall we proceed to finalize the contract?"
                    ]
                },
                {
                    "id": 7,
                    "is_start": false,
                    "label": "final_message",
                    "utterances": [
                        "I understand. If you need any further assistance, feel free to reach out. Have a great day!"
                    ]
                },
                {
                    "id": 8,
                    "is_start": false,
                    "label": "provide_requirements",
                    "utterances": [
                        "Here are our main requirements."
                    ]
                },
                {
                    "id": 9,
                    "is_start": false,
                    "label": "request_change_budget",
                    "utterances": [
                        "Actually, can I change the budget?"
                    ]
                },
                {
                    "id": 10,
                    "is_start": false,
                    "label": "set_budget_100k",
                    "utterances": [
                        "Our budget is $100,000."
                    ]
                },
                {
                    "id": 11,
                    "is_start": false,
                    "label": "set_budget_120k",
                    "utterances": [
                        "We can increase the budget to $120,000.",
                        "After reconsidering, we’d like to set the budget at $120,000."
                    ]
                },
                {
                    "id": 12,
                    "is_start": false,
                    "label": "exit_negotiation",
                    "utterances": []
                }
            ]
        }
    },
    "topic": "Negotiating enterprise contracts."
}